In [43]:
import pandas as pd

In [44]:
data={ 'name':['Alice','Bob','Charlie'],'age':[30,35,39]}

In [45]:
df=pd.DataFrame(data)

In [46]:
df.head()

      name  age
0    Alice   30
1      Bob   35
2  Charlie   39

In [47]:
df.at[0,'age']=26

In [48]:
df.head()

      name  age
0    Alice   26
1      Bob   35
2  Charlie   39

In [49]:
df.loc[0, 'age'] = 25
df.head()

      name  age
0    Alice   25
1      Bob   35
2  Charlie   39

In [50]:
df.columns

Index(['name', 'age'], dtype='object')

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [52]:
df.iloc[0, 1] = 36
df.head()

      name  age
0    Alice   36
1      Bob   35
2  Charlie   39

In [53]:
df.age
# df['age']

0    36
1    35
2    39
Name: age, dtype: int64

In [54]:
df['height']

KeyError: 'height'

In [55]:
df['height'] = [165, 180, 175]
df.head()

      name  age  height
0    Alice   36     165
1      Bob   35     180
2  Charlie   39     175

In [56]:
df['test'] = [2, 3]
df.head()

ValueError: Length of values (2) does not match length of index (3)

In [57]:
import numpy as np

In [58]:
df['test'] = [2, np.nan, 3]
df.head()

      name  age  height  test
0    Alice   36     165   2.0
1      Bob   35     180   NaN
2  Charlie   39     175   3.0

In [59]:
df.isna()

    name    age  height   test
0  False  False   False  False
1  False  False   False   True
2  False  False   False  False

In [60]:
df['gender'] = 'Male'
df.head()

      name  age  height  test gender
0    Alice   36     165   2.0   Male
1      Bob   35     180   NaN   Male
2  Charlie   39     175   3.0   Male

In [61]:
df.loc[3] = ['Eve', 29, 170, 3, 'Female']
df.loc[4] = ['Rob', 50, np.nan, 5, 'Male']
df.head()

      name  age  height  test  gender
0    Alice   36   165.0   2.0    Male
1      Bob   35   180.0   NaN    Male
2  Charlie   39   175.0   3.0    Male
3      Eve   29   170.0   3.0  Female
4      Rob   50     NaN   5.0    Male

In [62]:
df.isna()

    name    age  height   test  gender
0  False  False   False  False   False
1  False  False   False   True   False
2  False  False   False  False   False
3  False  False   False  False   False
4  False  False    True  False   False

In [63]:
df.isna().sum()

name      0
age       0
height    1
test      1
gender    0
dtype: int64